INSA-GEI/arm-ada/firmware/System/drivers/glcd-8bits-stm32.c
/*******************************************************************************
 * Write data to LCD                                                            *
 *   Parameter: data to be write (uint8_t)								                       *
 *   Return:                                                                    *
 *******************************************************************************/
static void write_data(uint8_t data)
{
	GPIOC->ODR &= 0xFF00;
	GPIOC->ODR |= data;
}

/*******************************************************************************
 * Read data from LCD                                                           *
 *   Parameter:                          								                       *
 *   Return: data read (uint8_t)                                                *
 *******************************************************************************/
static uint8_t read_data(void)
{
	return (uint8_t)(GPIOC->IDR & 0x00FF);
}

/*******************************************************************************
 * Read contents of a register                                                  *
 *   Parameter:  reg: register number to read (uint8_t)                         *
 *   Return: register content (uint8_t)                                         *
 *******************************************************************************/
static uint8_t LCD_RegisterRead(uint8_t reg)
{
	uint8_t value;

	while (!LCD_GET_WAIT); /* Attente que le signal wait repasse à 1 (fin du dernier traitement) */

	LCD_CS_0;

	set_data_output();
	write_data(reg);

	LCD_WR_0;
#if (NB_NOP_WR == 1)
	__NOP();
#endif /* NB_NOP_WR == 1 */

#if (NB_NOP_WR == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 2 */

#if (NB_NOP_WR == 3)
	__NOP();
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 3 */

	LCD_WR_1;
	LCD_CS_1;

	set_data_input();

	LCD_RS_0;
	LCD_CS_0;
	LCD_RD_0;

#if (NB_NOP_RD == 1)
	__NOP();
#endif /* NB_NOP_RD == 1 */

#if (NB_NOP_RD == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_RD == 2 */

#if (NB_NOP_RD == 3)
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_RD == 3 */

	value = read_data();

	LCD_RD_1;
	LCD_RS_1;
	LCD_CS_1;

	//set_data_output();
	return value;
}

/*******************************************************************************
 * Write data to LCD                                                            *
 *   Parameter: Reg: register number (uint8_t) 					                       *
 *              data: value to write into register (uint8_t)                    *
 *   Return:                                                                    *
 *******************************************************************************/
static void LCD_RegisterWrite(uint8_t reg, uint8_t data)
{
	while (!LCD_GET_WAIT); /* Attente que le signal wait repasse � 1 (fin du dernier traitement) */

	LCD_CS_0;

	set_data_output();
	write_data(reg);

	LCD_WR_0;

#if (NB_NOP_WR == 1)
	__NOP();
#endif /* NB_NOP_WR == 1 */

#if (NB_NOP_WR == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 2 */

#if (NB_NOP_WR == 3)
	__NOP();
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 3 */

	LCD_WR_1;
	LCD_CS_1;

	LCD_RS_0;
	LCD_CS_0;

	write_data(data);
	LCD_WR_0;

#if (NB_NOP_WR == 1)
	__NOP();
#endif /* NB_NOP_WR == 1 */

#if (NB_NOP_WR == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 2 */

#if (NB_NOP_WR == 3)
	__NOP();
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 3 */

	LCD_WR_1;
	LCD_RS_1;
	LCD_CS_1;

	set_data_input();
}

/*******************************************************************************
 * Write buffer to LCD                                                          *
 *   Parameter: Reg: register number (uint8_t) 					                       *
 *              data: pointer to buffer to be write (uint8_t *)                   *
 *              length: length of buffer (int)                                  *
 *   Return:                                                                    *
 *******************************************************************************/
static void LCD_RegisterWriteBuffer(uint8_t reg, uint8_t *data, int length)
{
	int i;

	i=0;
	while (!LCD_GET_WAIT); /* Attente que le signal wait repasse � 1 (fin du dernier traitement) */

	LCD_CS_0;

	set_data_output();
	write_data(reg);

	LCD_WR_0;

#if (NB_NOP_WR == 1)
	__NOP();
#endif /* NB_NOP_WR == 1 */

#if (NB_NOP_WR == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 2 */

#if (NB_NOP_WR == 3)
	__NOP();
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 3 */

	LCD_WR_1;
	LCD_CS_1;

	LCD_CS_0;
	LCD_RS_0;

	while (i<length)
	{
		while (!LCD_GET_WAIT); /* Attente que le signal wait repasse � 1 (fin du dernier traitement) */

		write_data(data[i]);
		i++;
		LCD_WR_0;

#if (NB_NOP_WR == 1)
		__NOP();
#endif /* NB_NOP_WR == 1 */

#if (NB_NOP_WR == 2)
		__NOP();
		__NOP();
#endif /* NB_NOP_WR == 2 */

#if (NB_NOP_WR == 3)
		__NOP();
		__NOP();
		__NOP();
		__NOP();
#endif /* NB_NOP_WR == 3 */

		LCD_WR_1;

	}

	LCD_RS_1;
	LCD_CS_1;

	set_data_input();
}

/*******************************************************************************
 * Get LCD status                                                               *
 *   Parameter:                                                                 *
 *   Return: status (uint8_t)                                                   *
 *******************************************************************************/
static uint8_t LCD_GetStatus(void)
{
	uint8_t value;

	LCD_CS_0;

	//set_data_input();

	LCD_RD_0;

#if (NB_NOP_RD == 1)
	__NOP();
#endif /* NB_NOP_RD == 1 */

#if (NB_NOP_RD == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_RD == 2 */

#if (NB_NOP_RD == 3)
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_RD == 3 */

	value = read_data();

	LCD_RD_1;
	LCD_CS_1;

