INSA-GEI/arm-ada/firmware/System/drivers/glcd-8bits-stm32.c
/*******************************************************************************
 * Set Layer mode                                                               *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_SetLayer(uint8_t layerNbr)
{
	LCD_RegisterWrite(0x41, (layerNbr & 0x01)); //MWCR1
}

/*******************************************************************************
 * Set Source point for BTE engine                                              *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTESetSource(uint32_t X, uint32_t Y, uint8_t layer)
{
	uint8_t temp;

	temp=X;
	LCD_RegisterWrite(0x54, temp); //HSBE0

	temp = (X>>8) & 0x03;
	LCD_RegisterWrite(0x55, temp); //HSBE1

	temp=Y;
	LCD_RegisterWrite(0x56, temp); //VSBE0

	temp = (Y>>8) & 0x01;
	temp = temp + (layer<<7);
	LCD_RegisterWrite(0x57, temp); //VSBE1	
}

/*******************************************************************************
 * Set destination point for BTE engine                                         *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTESetDestination(uint32_t X, uint32_t Y, uint8_t layer)
{
	uint8_t temp;

	temp=X;
	LCD_RegisterWrite(0x58, temp); //HDBE0

	temp = (X>>8) & 0x03;
	LCD_RegisterWrite(0x59, temp); //HDBE1

	temp=Y;
	LCD_RegisterWrite(0x5A, temp); //VDBE0

	temp = (Y>>8) & 0x01;
	temp = temp + (layer<<7);
	LCD_RegisterWrite(0x5B, temp); //VDBE1	
}

/*******************************************************************************
 * Set size for BTE engine                                                      *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTESetSize(uint32_t width, uint32_t height)
{
	uint8_t temp;

	temp=width;
	LCD_RegisterWrite(0x5C, temp); //BEWR0

	temp = (width>>8) & 0x03;
	LCD_RegisterWrite(0x5D, temp); //BEWR1

	temp=height;
	LCD_RegisterWrite(0x5E, temp); //BEHR0

	temp = (height>>8) & 0x01;
	LCD_RegisterWrite(0x5F, temp); //BEHR1	
}

/*******************************************************************************
 * Set background color for BTE                                                 *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTESetBackgroundColor(uint32_t red, uint32_t green, uint32_t blue)
{
	uint8_t temp;

	temp=red & 0x1F;
	LCD_RegisterWrite(0x60, temp); //BGCR0

	temp=green & 0x3F;
	LCD_RegisterWrite(0x61, temp); //BGCR1

	temp=blue & 0x1F;
	LCD_RegisterWrite(0x62, temp); //BGCR2
}

/*******************************************************************************
 * Set foreground color for BTE                                                 *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTESetForegroundColor(uint32_t red, uint32_t green, uint32_t blue)
{
	uint8_t temp;

	temp=red & 0x1F;
	LCD_RegisterWrite(0x63, temp); //FGCR0

	temp=green & 0x3F;
	LCD_RegisterWrite(0x64, temp); //FGCR1

	temp=blue & 0x1F;
	LCD_RegisterWrite(0x65, temp); //FGCR2
}

/*******************************************************************************
 * Set pattern set number                                                       *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTESetPatternNumber(uint8_t pattern)
{
	LCD_RegisterWrite(0x66, pattern & 0x1F); //PTNO
}

/*******************************************************************************
 * Set background color for transparency                                        *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_SetTransparentColor(COLOR color)
{
	LCD_RegisterWrite(0x67, color); //BGTR
}

/*******************************************************************************
 * Start BTE                                                                    *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTEStart(uint8_t source_mode, uint8_t dest_mode, uint8_t ROP, uint8_t operation)
{
	uint8_t temp;

	LCD_RegisterWrite(0x51, (ROP<<4)+operation); //BECR1
	LCD_RegisterWrite(0x50, (source_mode<<6)+(dest_mode<<5)+0x80); //BECR0

	temp=0x40;
	while ((temp & 0x40)!=0 )
	{
		temp=LCD_GetStatus() & 0x40;
	}
}

/*******************************************************************************
 * Start BTE and fill from SRAM                                                 *
 *   Parameter:                                                                 *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_BTEStartAndFillFromSRAM(uint8_t dest_mode, uint8_t ROP, uint8_t operation, uint32_t SRAM_Ptr, uint32_t size)
{
	uint32_t i;

	LCD_RegisterWrite(0x51, (ROP<<4)+operation); //BECR1
	LCD_RegisterWrite(0x50, (1<<6)+(dest_mode<<5)+0x80); //BECR0

	i=0;
	while (!LCD_GET_WAIT); /* Attente que le signal wait LCD repasse � 1 (fin du dernier traitement) */

