INSA-GEI/arm-ada/firmware/System/drivers/glcd-8bits-stm32.c
/*******************************************************************************
 * Draw a single line on screen                                                 *
 *   Parameter:  X1,Y1,X2,Y2: line dimension and coordinates                    *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_DrawLine (uint32_t x1, uint32_t y1, uint32_t x2, uint32_t y2)
{
	if (x1>x2) LCD_GeometricCoordinate(x2,y2,x1,y1); // setup rectangle coordinates
	else LCD_GeometricCoordinate(x1,y1,x2,y2);
	LCD_RegisterWrite(0x90, 0x80); // draw a line
}

/*******************************************************************************
 * Draw an empty rectangle on screen                                            *
 *   Parameter:  X1,Y1,X2,Y2: line dimension and coordinates                    *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_DrawRectangle (uint32_t x1, uint32_t y1, uint32_t x2, uint32_t y2)
{
	if (x1>x2) LCD_GeometricCoordinate(x2,y2,x1,y1); // setup rectangle coordinates
	else LCD_GeometricCoordinate(x1,y1,x2,y2);
	LCD_RegisterWrite(0x90, 0x90); // draw a rectangle
}

/*******************************************************************************
 * Draw a filled rectangle on screen                                            *
 *   Parameter:  X1,Y1,X2,Y2: line dimension and coordinates                    *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_DrawFillRectangle (uint32_t x1, uint32_t y1, uint32_t x2, uint32_t y2)
{
	if (x1>x2) LCD_GeometricCoordinate(x2,y2,x1,y1); // setup rectangle coordinates
	else LCD_GeometricCoordinate(x1,y1,x2,y2);
	LCD_RegisterWrite(0x90, 0xB0); // draw a filled rectangle
}

/*******************************************************************************
 * Draw an empty circle on screen                                               *
 *   Parameter:  X,Y, radius: circle dimension and coordinates                  *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_DrawCircle (uint32_t x, uint32_t y, uint32_t radius)
{
	LCD_CircleCoordinateRadius(x, y, radius);
	LCD_RegisterWrite(0x90,0x40); // Draw an hollow circle
}

/*******************************************************************************
 * Draw a filled circle on screen                                               *
 *   Parameter:  X,Y, radius: circle dimension and coordinates                  *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_DrawFillCircle (uint32_t x, uint32_t y, uint32_t radius)
{
	LCD_CircleCoordinateRadius(x, y, radius);
	LCD_RegisterWrite(0x90,0x60); // Draw a filled circle
}

/*******************************************************************************
 * Draw an image on screen                                                      *
 *   Parameter:  X,Y, radius: circle dimension and coordinates                  *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_DrawImage	(COLOR* data, uint32_t x, uint32_t y, uint32_t w, int32_t h)
{
	LCD_SetActiveWindow(x, x+w-1, y, y+h-1);
	GLCD_SetCursor(x,y);

	LCD_RegisterWriteBuffer(0x02, (uint8_t*)data, w*h);

	GLCD_WindowMax();
}

/*******************************************************************************
 * Draw an image on screen from SRAM                                            *
 *   Parameter:  X,Y, radius: circle dimension and coordinates                  *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_DrawImagefromSRAM	(uint32_t SRAM_Ptr, uint32_t x, uint32_t y, uint32_t w, int32_t h)
{
	uint32_t i, length;

	LCD_SetActiveWindow(x, x+w-1, y, y+h-1);
	GLCD_SetCursor(x,y);

	i=0;
	length = w*h;
	while (!LCD_GET_WAIT); /* Attente que le signal wait LCD repasse � 1 (fin du dernier traitement) */


	GPIOA->BRR = GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_15 ;
	LCD_CS_0;

	set_data_output();
	write_data(0x02);

	LCD_WR_0;

#if (NB_NOP_WR == 1)
	__NOP();
#endif /* NB_NOP_WR == 1 */

#if (NB_NOP_WR == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 2 */

#if (NB_NOP_WR == 3)
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 3 */

	LCD_WR_1;
	LCD_CS_1;

	set_data_input();

	LCD_CS_0;
	LCD_RS_0;

	SRAM_WE_1;
	SRAM_OE_0;
	SRAM_CE_0;

	while (i<length)
	{
		/* Positionne l'adresse cot� SRAM */
		GPIOD->ODR =  SRAM_Ptr & 0xFFFF;
		if (SRAM_Ptr>65535)
		{
			GPIOA->BRR = GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_15 ;
			GPIOA->ODR |= SRAM_AddrConvertionTable[(SRAM_Ptr>>16)];
		}

		while (!LCD_GET_WAIT); /* Attente que le signal wait repasse � 1 (fin du dernier traitement) */

		i++;
		SRAM_Ptr++;
		//	__NOP();
		//	__NOP();
		//	__NOP();

		LCD_WR_0;

#if (NB_NOP_WR == 1)
		__NOP();
#endif /* NB_NOP_WR == 1 */

#if (NB_NOP_WR == 2)
		__NOP();
		__NOP();
#endif /* NB_NOP_WR == 2 */

#if (NB_NOP_WR == 3)
		__NOP();
		__NOP();
		__NOP();
#endif /* NB_NOP_WR == 3 */

		LCD_WR_1;
	}

	LCD_RS_1;
	LCD_CS_1;

	SRAM_OE_1;
	SRAM_CE_1;
	GLCD_WindowMax();
}

void GLCD_DrawBargraph  (uint32_t x,  uint32_t y, uint32_t w, uint32_t h, uint32_t val)
{
}

/*******************************************************************************
 * Draw an image on screen                                                      *
 *   Parameter:  X,Y, radius: circle dimension and coordinates                  *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_SetScrollWindow (uint32_t x, uint32_t y, uint32_t w, uint32_t h)
{
	LCD_RegisterWrite(0x3A, (uint8_t)(y&0xFF)); 				// VSSW0
	LCD_RegisterWrite(0x3B, (uint8_t)((y&0x100)>>8)); 	// VSSW1
	LCD_RegisterWrite(0x38, (uint8_t)(x&0xFF)); 				// HSSW0
	LCD_RegisterWrite(0x39, (uint8_t)((x&0x300)>>8)); 	// HSSW1

	LCD_RegisterWrite(0x3E, (uint8_t)((y+h-1)&0xFF)); 				// VESW0
	LCD_RegisterWrite(0x3F, (uint8_t)(((y+h-1)&0x100)>>8)); 	// VESW1
	LCD_RegisterWrite(0x3C, (uint8_t)((x+w-1)&0xFF)); 				// HESW0
	LCD_RegisterWrite(0x3D, (uint8_t)(((x+w-1)&0x300)>>8)); 	// HESW1
}

/*******************************************************************************
 * Draw an image on screen                                                      *
 *   Parameter:  X,Y, radius: circle dimension and coordinates                  *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_ScrollVertical (uint32_t dy)
{
	LCD_RegisterWrite(0x27, (uint8_t)((dy&0x100)>>8)); 	// VOFS1
	LCD_RegisterWrite(0x26, (uint8_t)(dy&0xFF)); 				// VOFS0
}

/*******************************************************************************
 * Draw an image on screen                                                      *
 *   Parameter:  X,Y, radius: circle dimension and coordinates                  *
 *   Return:                                                                    *
 *******************************************************************************/
void GLCD_ScrollHorizontal (uint32_t dy)
{
	LCD_RegisterWrite(0x25, (uint8_t)((dy&0x300)>>8)); 	// VOFS1
	LCD_RegisterWrite(0x24, (uint8_t)(dy&0xFF)); 				// VOFS0
}

/******************************************************************************/
